Autodesk.Revit.DB.BuiltInFailures.EditingFailures.WorksetHasChangedInCentralFile
This workset has changed in the Central Model.  Please Reload Latest before making this workset editable.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToTransformElementError
Attempted an invalid element rotate, mirror, or move.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToTransformElement
Attempted an invalid element rotate, mirror, or move.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToMakeSourceWorksetEditable
Unable to make the necessary Workset ([Name]) editable in the Linked File in order to change the Shared Coordinates.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableFilletSpecifiedRadius
Unable to create Fillet with the specified radius.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TemporaryChangesTransparentPermissions
Permission to edit the element cannot be obtained.  Changes will be temporary, and will not be saved.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TemporaryChangesOutOfDate
You must Reload Latest before editing the element.  Changes will be temporary, and will not be saved.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TargetInEditMode
Can't transfer project standards while target document is in an edit mode.  Please exit all edit modes(In-Place
Family Edit Mode, Group Edit Mode, Sketch Edit Mode, etc.) and try again.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.SourceInEditMode
Can't transfer project standards while source document is in an edit mode.  Please exit all edit modes(In-Place
Family Edit Mode, Group Edit Mode, Sketch Edit Mode, etc.) and try again.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ReloadNoGood
You must Reload Latest before editing the element, but the Central Model is inaccessible or being accessed by another user.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ReloadBeforeMakeEditable
You must Reload Latest before editing the element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PressShowToSee
Press Show to see the element(s); then Ignore or Cancel

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectSomeDeleted
Some pinned objects were deleted while others were not.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectNotDeleted
Pinned objects were not deleted. To delete them, unpin them before using delete.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectHostDeleted
Some pinned objects were deleted because their parent or host object was deleted.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.OwnedByOther
Can't edit the element until '[Partition Name]' resaves the element to central and relinquishes it and you Reload Latest.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.OwnElementsOutOfDate
You now own the element, but your file is out of date.  You must Reload Latest before editing the element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.OutOfDateElements
Workset is editable, but you must Reload Latest before editing the element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NoRotateMirrorZError
Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NoRotateMirrorZ
Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NElementsWrongPosition
Review [Number] elements for correct position and shape

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NElementsDeleted
[Number] elements were deleted

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.MirrorProjectSuccess
[Action] command has successfully processed [Number] elements

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.LockedDeletedWarn
Pinned objects deleted.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.LockedDeleted
Pinned objects deleted.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.InvalidElemsInSelection
Can't scale elements together.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.InvalidArrayObject
Some or all of the selected objects can't be created in an Array (for example, a Camera object for a 3D View).

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.HiddenBeamsEditingWarning
The beam join being modified contains beam that are not visible.  Geometry of visible beams may be affected by hidden beams.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.HaveNoPermissionToEdit
You do not have permission to edit the element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.GeneratedByMassing
Selected element(s) produced from Massing shape. Once deleted, the selected element(s) will not be regenerated

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOtherWarn
Can't keep [Type Name] extended to [Type Name].

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOtherCrash
Can't keep [Type Name] extended to [Type Name].

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsWillBeDeleted
Elements in [Design Option] will be deleted

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsNotInPlane
Elements don't lie on the same plane.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsDeletedPastedToKeep
Elements were deleted.  Use Edit Pasted Elements to keep them.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsDeleted
Elements were deleted.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementReversed
Element is reversed.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementNotEditable
One or more elements are not editable.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeletedRequestedWarn
You have deleted elements that other users requested.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeletePreventedByGroup
Grouped elements can only be deleted when the group is being edited. To delete a member select the group and then click the Edit Group button on the toolbar, then delete the member.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeleteElementsWarn
[Description]

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.DeleteElementsError
[Description]

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotScaleInView
Can't scale because Move Plane is at a very sharp angle in this view. Change view angle or go to another view.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotRotateLocked
Can't rotate pinned element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotPickHereInCurrentView
Can't pick here at this view angle. Set another Work Plane or adjust the view.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveTogether
Can't move these elements at the same time. One of them is restricted to moving in one direction while the other is restricted to moving in a conflicting direction.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveLocked
Can't move pinned element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveInViewError
Can't move element because the move plane is seen at a very sharp angle in this View

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveInView
Can't move element because the move plane is seen at a very sharp angle in this View

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveHereInViewError
Can't move here at this view angle. Set another Work Plane or adjust the view.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElementWithoutWorkplane
Element(s) need a workplane to be moved in. There's no workplane defined in this view.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElementWarn
Can't move element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElement
Can't move element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMirrorInView
Must specify Work Plane to mirror in a 3d View.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditRenamedWorkset
Can't edit workset ' [Name] '.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditElements
Workset is editable, but you can't edit the element until '[Borrowers]' resaves the element to central and relinquishes it and you Reload Latest.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditEditingElements
Can't obtain permission to edit the element:  The Central Model is inaccessible and another user is editing the element.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditDeletedWorkset
This action has caused deletion of non-editable Workset ' [Name] '.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditDeletedElements
Can't edit the element.  It was deleted in the Central Model.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDuplicateType
Cannot Duplicate Type

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDrawInCurrentView
Can't draw because Work Plane is at a very sharp angle in this view. Go to another view or redefine the Work Plane.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeletePredefinedFamilyElement
Element is a built-in part of the family definition and cannot be deleted or added to groups.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeleteEditedElementError
Can't delete element that is being edited.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeleteEditedElement
Can't delete element that is being edited.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotCheckoutWorksets
Can't make workset editable. User '[Borrowers]' has already checked it out.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotBorrowBusyContention
Can't obtain permission to edit the element.  The Central Model is busy.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.BorrowElementsAtRisk
Can't obtain permission to edit the element:  The Central Model is inaccessible.  You can check out worksets at risk, but consider carefully!

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.AllInvisibleInViewWarn
None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures.AllInvisibleInPlanViewWarn
None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings.

Autodesk.Revit.DB.BuiltInFailures.EditingFailures
Failures related to editing operations.